Core/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Вспомогательный</name>
      <description>Вспомогательный счет</description>
      <code>0000   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПереводыВПути</name>
      <description>Переводы в пути</description>
      <code>1290   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыПоАвансамВыданным</name>
      <description>Расчеты по авансам выданным</description>
      <code>1480   </code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>1610   </code>
    </items>
    <items>
      <name>ПоставляемыеМатериалы</name>
      <description>გადაცემული მარაგები</description>
      <code>1629      </code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>3100   </code>
      <accountType>Passive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>3110   </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>НалоговыеОбязательства</name>
      <description>გადასახდელი დღგ</description>
      <code>3330   </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НалоговыеОбязательства_1</name>
      <description>გადასახდელი დღგ (/1)</description>
      <code>3330/1    </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НачисленныйНДСНаПолученныйАванс</name>
      <description>მიღებულ ავანსზე დარიცხული დღგ</description>
      <code>3331   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПредворительныйЗачетПолученныйНаВыдааныАванс</name>
      <description>გაცემულ ავანსზე მიღებული წინასწარი ჩათვლა</description>
      <code>3332   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>НДС</name>
      <description>გადახდილი დღგ</description>
      <code>3340   </code>
    </items>
    <items>
      <name>НДС_1</name>
      <description>გადახდილი დღგ (/1)</description>
      <code>3340/1    </code>
    </items>
    <items>
      <name>ОплаченныеКОплатеНДСНаАванс</name>
      <description>ავანსზე გადახდილი/გადასახდელი დღგ</description>
      <code>3341   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ЗачетПолученногоНДСНаВыданныАванс</name>
      <description>გაცემულ ავანსის თანხებზე მიღებული დღგ-ს ჩათვლა</description>
      <code>3342   </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБыстрогоВыбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетАналогУУ</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределения</name>
    <type>
      <types>EnumRef.БазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗакрытия</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходовИРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyMapping</name>
    <type>
      <types>CatalogRef.AzRyMapping</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>НалоговыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/ChartsOfAccounts/Хозрасчетный/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)

	Если ПланыСчетов.Хозрасчетный.ПропущенаБизнесЛогикаПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Предопределенный 
		И Родитель <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Родитель") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ka='არ შეიძლება წინასწარგანსაზღვრული ანგარიშების დაქვემდებარების შეცვლა';ru='Нельзя изменять подчиненность предопределенных счетов!';en='You can not change the subordination of predefined accounts!'"), ЭтотОбъект, "Родитель", , Отказ);
	КонецЕсли;
	
	Порядок = ПолучитьПорядокКода();

	Если НЕ ЗначениеЗаполнено(КодБыстрогоВыбора) Тогда
		КодБыстрогоВыбора = СокрЛП(СтрЗаменить(Код, ".", ""));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Удаление проверяемых реквизитов из структуры, в зависимости от функциональной 
	// опции.
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьБюджетирование.Получить()
		  И ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗакрытия");
	КонецЕсли;
	
	Если Константы.ФункциональнаяОпцияИспользоватьБюджетирование.Получить()
	   И ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
	   И ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗакрытия");
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
